app/controllers/notes_controller.rb

  def create
    note = current_user.sent_notes.create!(params[:note])
---
INSERT INTO "notes" ("created_at", "body", "updated_at", "to_user_id", "from_user_id") VALUES('2010-01-08 14:16:45', 'fdsjklfds', '2010-01-08 14:16:45', 2, 1)