app/controllers/sessions_controller.rb

  def create
    @user = User.find_by_email(params[:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'mmangino@elevatedrails.com') LIMIT 1